dict = {
    "Калининград": 22,
    "Мурманск": 23,
    "Петрозаводск": 18,
    "Санкт-Петербург": 2,
    "Псков": 25,
    "Великие Луки": 10928,
    "Великий Новгород": 24,
    "Тверь": 14,
    "Смоленск": 12,
    "Брянск": 191,
    "Калуга": 6,
    "Обнинск": 967,
    "Курск": 8,
    "Орёл": 10,
    "Тула": 15,
    "Москва": 213,
    "Долгопрудный": 214,
    "Дубна": 215,
    "Зеленоград": 216,
    "Пущино": 217,
    "Белгород": 4,
    "Липецк": 9,
    "Ярославль": 16,
    "Владимир": 192,
    "Александров": 10656,
    "Гусь-Хрустальный": 10661,
    "Муром": 10668,
    "Иваново": 5,
    "Рязань": 11,
    "Тамбов": 13,
    "Воронеж": 193,
    "Ростов-на-Дону": 39,
    "Шахты": 11053,
    "Таганрог": 971,
    "Новочеркасск": 238,
    "Волгодонск": 11036,
    "Краснодар": 35,
    "Анапа": 1107,
    "Новороссийск": 970,
    "Сочи": 239,
    "Туапсе": 1058,
    "Геленджик": 10990,
    "Армавир": 10987,
    "Ейск": 10993,
    "Майкоп": 1093,
    "Черкесск": 1104,
    "Нальчик": 30,
    "Владикавказ": 33,
    "Грозный": 1106,
    "Махачкала": 28,
    "Ставрополь": 36,
    "Каменск-Шахтинский": 11043,
    "Пятигорск": 11067,
    "Минеральные Воды": 11063,
    "Ессентуки": 11057,
    "Кисловодск": 11062,
    "Элиста": 1094,
    "Астрахань": 37,
    "Волгоград": 38,
    "Саратов": 194,
    "Жигулевск": 11132,
    "Балаково": 11143,
    "Пенза": 49,
    "Саранск": 42,
    "Ульяновск": 195,
    "Самара": 51,
    "Тольятти": 240,
    "Сызрань": 11139,
    "Чебоксары": 45,
    "Йошкар-Ола": 41,
    "Нижний Новгород": 47,
    "Саров": 11083,
    "Киров": 46,
    "Кострома": 7,
    "Вологда": 21,
    "Архангельск": 20,
    "Северодвинск": 10849,
    "Сыктывкар": 19,
    "Ижевск": 44,
    "Казань": 43,
    "Набережные Челны": 236,
    "Нижнекамск": 11127,
    "Пермь": 50,
    "Уфа": 172,
    "Нефтекамск": 11114,
    "Салават": 11115,
    "Стерлитамак": 11116,
    "Оренбург": 48,
    "Дзержинск": 972,
    "Челябинск": 56,
    "Магнитогорск": 235,
    "Снежинск": 11218,
    "Курган": 53,
    "Екатеринбург": 54,
    "Каменск-Уральский": 11164,
    "Нижний Тагил": 11168,
    "Новоуральск": 11170,
    "Первоуральск": 11171,
    "Тюмень": 55,
    "Тобольск": 11175,
    "Ханты-Мансийск": 57,
    "Сургут": 973,
    "Нижневартовск": 1091,
    "Омск": 66,
    "Новосибирск": 65,
    "Бердск": 11314,
    "Салехард": 58,
    "Барнаул": 197,
    "Бийск": 975,
    "Рубцовск": 11251,
    "Горно-Алтайск": 11319,
    "Кемерово": 64,
    "Междуреченск": 11287,
    "Новокузнецк": 237,
    "Прокопьевск": 11291,
    "Абакан": 1095,
    "Кызыл": 11333,
    "Красноярск": 62,
    "Ачинск": 11302,
    "Норильск": 11311,
    "Железногорск": 20086,
    "Иркутск": 63,
    "Братск": 976,
    "Улан-Удэ": 198,
    "Чита": 68,
    "Якутск": 74,
    "Благовещенск": 77,
    "Биробиджан": 11393,
    "Владивосток": 75,
    "Находка": 974,
    "Уссурийск": 11426,
    "Анадырь": 11458,
    "Петропавловск-Камчатский": 78,
    "Магадан": 79,
    "Южно-Сахалинск": 80,
    "Хабаровск": 76,
    "Комсомольск-на-Амуре": 11453
};

capitals ={
    "Белгородская область": "Белгород",
    "Брянская область": "Брянск",
    "Владимирская область": "Владимир",
    "Воронежская область": "Воронеж",
    "Ивановская область": "Иваново",
    "Калужская область": "Калуга",
    "Костромская область": "Кострома",
    "Курская область": "Курск",
    "Липецкая область": "Липецк",
    "Москва и Московская область": "Москва",
    "Орловская область": "Орёл",
    "Рязанская область": "Рязань",
    "Смоленская область": "Смоленск",
    "Тамбовская область": "Тамбов",
    "Тверская область": "Тверь",
    "Тульская область": "Тула",
    "Ярославская область": "Ярославль",
    "Архангельская область": "Архангельск",
    "Вологодская область": "Вологда",
    "Калининградская область": "Калининград",
    "Республика Карелия": "Петрозаводск",
    "Республика Коми": "Сыктывкар",
    "Санкт-Петербург и Ленинградская область": "Санкт-Петербург",
    "Мурманская область": "Мурманск",
    "Ненецкий автономный округ": "Салехард",
    "Новгородская область": "Великий Новгород",
    "Псковская область": "Псков",
    "Санкт-Петербург": "Санкт-Петербург",
    "Республика Башкортостан": "Уфа",
    "Кировская область": "Киров",
    "Республика Марий Эл": "Йошкар-Ола",
    "Республика Мордовия": "Саранск",
    "Нижегородская область": "Нижний Новгород",
    "Оренбургская область": "Оренбург",
    "Пензенская область": "Пенза",
    "Пермский край": "Пермь",
    "Самарская область": "Самара",
    "Саратовская область": "Саратов",
    "Республика Татарстан": "Казань",
    "Удмуртская Республика": "Ижевск",
    "Ульяновская область": "Ульяновск",
    "Чувашская Республика": "Чебоксары",
    "Курганская область": "Курган",
    "Свердловская область": "Екатеринбург",
    "Тюменская область": "Тюмень",
    "Ханты-Мансийский автономный округ — Югра": "Ханты-мансийск",
    "Челябинская область": "Челябиннск",
    "Ямало-Ненецкий автономный округ": "Салехард",
    "Республика Алтай": "Горно-Алтайск",
    "Алтайский край": "Барнаул",
    "Республика Бурятия": "Улан-Удэ",
    "Забайкальский край": "Чита",
    "Иркутская область": "Иркутск",
    "Кемеровская область": "Кемерово",
    "Красноярский край": "Красноярск",
    "Новосибирская область": "Новосибирск",
    "Омская область": "Омск",
    "Томская область": "Томск",
    "Республика Тыва": "Кызыл",
    "Республика Хакасия": "Абакан",
    "Амурская область": "Благовещенск",
    "Еврейская автономная область": "Биробиджан",
    "Камчатская область": "Петропавловск-Камчатский",
    "Магаданская область": "Магадан",
    "Приморский край": "Владивосток",
    "Республика Саха (Якутия)": "Якутск",
    "Сахалинская область": "Южно-Сахалинск",
    "Хабаровский край": "Хабаровск",
    "Чукотский автономный округ": "Анадырь",
    "Республика Адыгея": "Майкоп",
    "Астраханская область": "Астрахань",
    "Волгоградская область": "Волгоград",
    "Республика Калмыкия": "Элиста",
    "Краснодарский край": "Краснодар",
    "Ростовская область": "Ростов",
    "Республика Дагестан": "Махачкала",
    "Республика Ингушетия": "Магас",
    "Кабардино — Балкарская Республика": "Нальчик",
    "Карачаево — Черкесская Республика": "Черкесск",
    "Республика Северная Осетия-Алания": "Владивкавказ",
    "Ставропольский край": "Ставрополь",
    "Чеченская Республика": "Грозный"
}

$(document).ready(function() {
    if (YMaps.location)
    {
        cita = YMaps.location.city;
        obl = YMaps.location.region;
        if (dict[$('#select-city').val(cita)] > 0) {
            $('#select-city').val(cita);
        }
        else {
            cap = capitals[obl];
            $('#select-city').val(cap);
        }
    }
    else
        alert("Пожалуйста, разрешите доступ к использованию Вашей геопозиции!");
});

target = dict[$('#select-city').val()];

function requ() {
    $.ajax({
        method: "POST",
        url: "/php/weather.php",
        data: {city: target},
        success: function(data) {
            $(".weather__temp-number").val(data);
            var value = $('.weather__temp-number').val();
            var size  = value.length;
            $(".weather__temp input[type=number]").css('width',(size+2)*6);
            if ($('.weather__temp-number').val() <= -20)
            {
                $('.spending__temp-number').val(20*1.3);
            }

            if (($('.weather__temp-number').val() <= -10) && ($('.weather__temp-number').val() > -20))
            {
                $('.spending__temp-number').val(20*1.2);
            }

            if (($('.weather__temp-number').val() <= 0) && ($('.weather__temp-number').val() > -10))
            {
                $('.spending__temp-number').val(20*1.1);
            }
            if (($('.weather__temp-number').val() <= 10) && ($('.weather__temp-number').val() > 0))
            {
                $('.spending__temp-number').val(20*1.05);
            }
            if (($('.weather__temp-number').val() > 10))
            {
                $('.spending__temp-number').val(20);
            }
        }
    });
};

$('.city-select').on('change', function () {
    target = dict[$('#select-city').val()];
    requ();
});

window.addEventListener('DOMContentLoaded', function() {
    requ();
});

